03-Res-Latency-hotel-Swarm-2profile-better/hotel-2profile-machine1-better/Res-container-random-Swarm-v1-machine1/container_t_10_c_30_frontCore_4_wrkCore_1_R_2000/wrk.txt
Running 2m test @ http://128.226.119.92:5000
  10 threads and 30 connections
  Thread calibration: mean lat.: 5506.980ms, rate sampling interval: 18251ms
  Thread calibration: mean lat.: 4598.185ms, rate sampling interval: 18235ms
  Thread calibration: mean lat.: 5357.929ms, rate sampling interval: 19283ms
  Thread calibration: mean lat.: 4572.396ms, rate sampling interval: 18743ms
  Thread calibration: mean lat.: 3181.253ms, rate sampling interval: 9117ms
  Thread calibration: mean lat.: 6197.878ms, rate sampling interval: 18120ms
  Thread calibration: mean lat.: 2399.941ms, rate sampling interval: 13369ms
  Thread calibration: mean lat.: 5071.851ms, rate sampling interval: 18628ms
  Thread calibration: mean lat.: 5999.465ms, rate sampling interval: 18989ms
  Thread calibration: mean lat.: 2980.754ms, rate sampling interval: 16474ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    13.99s     7.96s   34.18s    67.64%
    Req/Sec   208.25     88.39   298.00     76.56%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   14.51s 
 75.000%   18.32s 
 90.000%   24.77s 
 99.000%   34.18s 
 99.900%   38.08s 
 99.990%   39.22s 
 99.999%   39.39s 
100.000%   39.39s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.425     0.000000            1         1.00
    2220.031     0.100000        23258         1.11
    6852.607     0.200000        46541         1.25
   10125.311     0.300000        69786         1.43
   12713.983     0.400000        93129         1.67
   14508.031     0.500000       116319         2.00
   15310.847     0.550000       128052         2.22
   16048.127     0.600000       139577         2.50
   16809.983     0.650000       151510         2.86
   17530.879     0.700000       162863         3.33
   18317.311     0.750000       174452         4.00
   18874.367     0.775000       180277         4.44
   19529.727     0.800000       186064         5.00
   20463.615     0.825000       191900         5.71
   21643.263     0.850000       197722         6.67
   23379.967     0.875000       203512         8.00
   24117.247     0.887500       206441         8.89
   24772.607     0.900000       209340        10.00
   25460.735     0.912500       212244        11.43
   26263.551     0.925000       215194        13.33
   27131.903     0.937500       218099        16.00
   27557.887     0.943750       219511        17.78
   28016.639     0.950000       220968        20.00
   28491.775     0.956250       222411        22.86
   29048.831     0.962500       223910        26.67
   29605.887     0.968750       225341        32.00
   29966.335     0.971875       226040        35.56
   30490.623     0.975000       226766        40.00
   31047.679     0.978125       227492        45.71
   31555.583     0.981250       228221        53.33
   32112.639     0.984375       228958        64.00
   32571.391     0.985938       229321        71.11
   33144.831     0.987500       229676        80.00
   33751.039     0.989062       230037        91.43
   34504.703     0.990625       230406       106.67
   34897.919     0.992188       230762       128.00
   35028.991     0.992969       230955       142.22
   35225.599     0.993750       231141       160.00
   35454.975     0.994531       231315       182.86
   35717.119     0.995313       231511       213.33
   35946.495     0.996094       231679       256.00
   36077.567     0.996484       231781       284.44
   36175.871     0.996875       231857       320.00
   36339.711     0.997266       231969       365.71
   36503.551     0.997656       232047       426.67
   36995.071     0.998047       232129       512.00
   37158.911     0.998242       232180       568.89
   37421.055     0.998437       232218       640.00
   37650.431     0.998633       232262       731.43
   37912.575     0.998828       232310       853.33
   38109.183     0.999023       232371      1024.00
   38141.951     0.999121       232384      1137.78
   38207.487     0.999219       232398      1280.00
   38305.791     0.999316       232423      1462.86
   38436.863     0.999414       232444      1706.67
   38567.935     0.999512       232468      2048.00
   38600.703     0.999561       232477      2275.56
   38699.007     0.999609       232490      2560.00
   38764.543     0.999658       232502      2925.71
   38895.615     0.999707       232513      3413.33
   38961.151     0.999756       232527      4096.00
   38993.919     0.999780       232531      4551.11
   39026.687     0.999805       232535      5120.00
   39092.223     0.999829       232549      5851.43
   39092.223     0.999854       232549      6826.67
   39124.991     0.999878       232551      8192.00
   39190.527     0.999890       232555      9102.22
   39223.295     0.999902       232557     10240.00
   39288.831     0.999915       232563     11702.86
   39288.831     0.999927       232563     13653.33
   39321.599     0.999939       232567     16384.00
   39321.599     0.999945       232567     18204.44
   39354.367     0.999951       232569     20480.00
   39387.135     0.999957       232579     23405.71
   39387.135     1.000000       232579          inf
#[Mean    =    13993.613, StdDeviation   =     7959.926]
#[Max     =    39354.368, Total count    =       232579]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  232868 requests in 2.00m, 82.10MB read
  Socket errors: connect 0, read 0, write 0, timeout 1
Requests/sec:   1940.57
Transfer/sec:    700.57KB